#+AUTHOR: Mauricio Fernández.
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: email:nil
#+TITLE: Creating a CL-RiveScript Interpreter (Part 13)

** Fixing the includes/inherits situation

When I originally implemented inheritance I confused inclusion with inheritance, the function we just defined looks for all triggers that are included, and it works, and the ~get-answers~ function does inheritance correctly but still is stuck in pre-wildcard times, by combining this two things and fixing the code that defines the links to inherited and included topics we can have a complete and correct solution.

Lets start by fixing the ~topic~ function, this function gets called when the word immediately after ">" is topic, and the argument is the list of all words that follow the "topic" keyword. The current function is broken in several ways, for example it only takes one "includes" argument that must immediately follow the topic name, and the rest of the arguments are assumed to be inherited topics even though they follow an "includes" keyword.

The working draft states that.

#+BEGIN_QUOTE
"You can use as many "includes" and "inherits" keywords as you want, but the order you specify them has no effect."
#+END_QUOTE

This means that we have to make our function more robust. We need two lists, one for "includes" and one for "inherits".
We will start by writing a function to split the lists based on keywords.

#+BEGIN_SRC lisp :exports code
  (defun split-lists (ids list)
    "Receives a list of ids and a list to be separated,
  creates a list for each id, with the elements that follow it"
    (let ((lists (make-sequence 'list (length ids))))
      (loop
         for e in list
         for b = (position e ids :test #'string=)
         for i = (or b i) unless (or b (not i)) do (push e (nth i lists)))
      (mapcar #'nreverse lists)))

#+END_SRC

The =ids= argument is a list of strings that will serve as separators for the list passed in the =list= argument, the function goes trough every element in the list, if it is in the list of ids the variable =i= is assigned the position of the string in the =ids= list, otherwise it retains its current value, if the element is not an id it is pushed in the list in the position of the last id matched, finally all the lists get reversed to reflect the original order, and that is the output of the function. Here is an example.

#+BEGIN_SRC lisp :exports both
  (split-lists '("includes" "inherits") '("includes" "Reed" "Sue" "Johny" "Ben" "inherits" "Marvel" "Comics" "includes" "Pym"))
#+END_SRC

#+RESULTS:
| Reed   | Sue    | Johny | Ben | Pym |
| Marvel | Comics |       |     |     |

Notice that if the list doesn't start with an id, =i= will be =nil= and the =nth= function would fail, the ~(not i)~ is there to prevent that. I included two "includes" in the list to verify the behavior. With this in place we can use a ~destructuring-bind~ to assign the variables.

When  we defined labels, the convention was to read whatever follows the ">" as a the function name to be called with the rest of the line being the arguments as list of strings, the function to define a topic was ~topic~, this is the new definition.

#+BEGIN_SRC lisp :exports code
  (defun topic (&rest args)
    "Define the contents of a conversation topic"
    (when args
      (let ((topic (switch-topic (car args) :create t))
            (related (cdr args)))
        (destructuring-bind (includes inherits) (if related
                                                   (split-lists '("includes" "inherits") related)
                                                   '(nil nil))
          (with-input-from-string (s (get-captured-text))
            (loop for line = (read-line s nil 'eof)
               until (eq line 'eof)
               do (process-line line))
            (loop for included-topic in includes
               do (link-create :includes topic (switch-topic included-topic :create t)))
            (loop for i from 1 for inherited-topic in inherits
               do (link-create :inherits topic (switch-topic inherited-topic :create t) :properties `(:order ,i)))))))
    (setf *current-topic* *default-topic*))

#+END_SRC

This basically creates topic links without any particular properties for the inclusions, and links them using an appropriate link type, and then it does the same but for the inherited topics, in this case storing an =:order= property to be used to go through the inherited topics in order.

The only thing that we still need to do about the inheritance/inclusion situation is fixing ~get-answers~, but there is where we will put everything together, so we will leave it for later right now we have to do one more thing.

